InformationRegisters/СистемыНалогообложенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СистемыНалогообложенияОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяПатент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикТорговыйСбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РозничнаяПродажаАлкоголя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышеннаяСтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяАУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДСПрименяющийУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упрощенная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсобыйПорядок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АУСН</Name>
					<Comment>Автоматизированная УСН</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/УчетнаяПолитика/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Определяет параметр Период функциональной опции, которая зависит от системы налогообложения.
//
// Параметры:
//   Организация - СправочникСсылка.Организации
//   Период - Дата - Дата, на которую требуется определить настройку системы налогообложения
//   ДатаИзменения - возвращаемое значение даты изменения системы налогообложения
//
// Возвращаемое значение:
//   Дата - Дата, приведенная к началу этого, либо прошлого месяца
//
Функция ПериодНастройкиСистемыНалогообложения(Организация, Период, ДатаИзменения = Неопределено) Экспорт
	
	// Значение Системы налогообложения записывается всегда на первое число месяца, но иногда может измениться
	// в любой день месяца. Поэтому значение Системы нужно брать за этот месяц, если изменения уже вступили в силу,
	// либо за прошлый, если не вступили.
	
	ЭтотМесяц = НачалоМесяца(Период);
	
	//ДатаИзменения = ПолучитьФункциональнуюОпцию("ДатаИзмененияСистемыНалогообложения",
	//	Новый Структура("Организация, Период", Организация, ЭтотМесяц));
	//
	// Если ДатаИзменения <> Ложь // Значение существует
	//	И (ЭтотМесяц < ДатаИзменения И ДатаИзменения < ДобавитьМесяц(ЭтотМесяц, 1)) // Система НО менялась в течение месяца
	//	И Период < ДатаИзменения Тогда // Значение еще не вступило в силу
	//	Возврат ДобавитьМесяц(ЭтотМесяц, -1); // Прошлый месяц
	//Иначе
	//	Если ДатаИзменения = Ложь Тогда
	//		ДатаИзменения = Дата(1, 1, 1); // Приведение типа
	//	КонецЕсли;
	//	Возврат ЭтотМесяц;
	//КонецЕсли;
	
	Возврат ЭтотМесяц;
	
КонецФункции

Функция ПлательщикЕНП(Организация, Период) Экспорт
	
	Если Период >= Дата(2023,1, 1) Тогда
		Результат = Истина;
	ИначеЕсли Период < Дата(2022,7, 1) Тогда
		Результат = Ложь;
	Иначе 
		СистемаНалогообложения = РегистрыСведений.СистемыНалогообложенияОрганизаций.ПолучитьПоследнее(КонецДня(Период), Новый Структура("Организация", Организация));
		
		Результат = СистемаНалогообложения.ПлательщикЕНП;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Возвращает признак применения системы налогообложения АУСН.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - Организация
//   Период - Дата - Дата, на которую требуется определить настройку системы налогообложения
//
// Возвращаемое значение:
//   Булево - признак применения АУСН
//
Функция ПрименяетсяАУСН(Организация, Период) Экспорт
	
	СистемаНалогообложения =
		РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(Организация, Период);
	Результат = СистемаНалогообложения.ПрименяетсяАУСН;
			
	Возврат Результат;
	
КонецФункции

Функция СистемаНалогообложения(Организация, Период, ДатаИзменения = Неопределено) Экспорт

	Результат = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(Организация, Период);

	Если Результат = Ложь Тогда
		Результат = Перечисления.СистемыНалогообложения.Общая;
	КонецЕсли;

	Возврат Результат;

КонецФункции 

Функция ПрименяетсяТолькоУСНПатент(Организация, Период) Экспорт
	
	СистемаНалогообложения =
		РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(Организация, Период);
	Результат = СистемаНалогообложения.ПлательщикУСН 
	И СистемаНалогообложения.ПрименяетсяПатент;
			
	Возврат Результат;
	
КонецФункции

// Определяет, применялся ли УСН выбранной организацией в течение заданного периода
//
// Параметры:
//  Организация		 - СправочникСсылка.Организации 
//  НачалоПериода	 - Дата
//  КонецПериода	 - Дата
// 
// Возвращаемое значение:
//   - Булево
//
Функция ПрименяетсяУСНЗаПериод(Организация, НачалоПериода, КонецПериода) Экспорт
	
	МассивЗначений = РегистрыСведений.СистемыНалогообложенияОрганизаций.ЗначенияРесурсаУчетнойПолитикиЗаПериод(
		"ПлательщикУСН",
		Организация,
		ПериодНастройкиСистемыНалогообложения(Организация, НачалоПериода),
		ПериодНастройкиСистемыНалогообложения(Организация, КонецПериода));
	
	Результат = Ложь;
	Для Каждого Значение Из МассивЗначений Цикл
		Результат = Результат ИЛИ Значение;
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Функция ПрименяетсяОсвобождениеОтУплатыНДС(Организация, Период) Экспорт 
	
	СистемаНалогообложения = РегистрыСведений.СистемыНалогообложенияОрганизаций.ПолучитьПоследнее(
	КонецДня(Период), Новый Структура("Организация", Организация));
	Возврат СистемаНалогообложения.ПрименяетсяОсвобождениеОтУплатыНДС; 
	
КонецФункции

// Параметры учетной политики по НДС

Функция ПлательщикНДС(Организация, Период, ДатаИзменения = Неопределено) Экспорт
	
	СистемаНалогообложения = РегистрыСведений.СистемыНалогообложенияОрганизаций.ПолучитьПоследнее(КонецДня(Период), Новый Структура("Организация", Организация));
	
	Возврат СистемаНалогообложения.ПлательщикНДС;
	
КонецФункции   

#КонецОбласти
